## SQL Methods

In [1]:
# Install sql extension
%pip install ipython-sql

Collecting ipython-sql
  Obtaining dependency information for ipython-sql from https://files.pythonhosted.org/packages/30/8f/9e50fa53ffc371483f9d1b90c1175b706d28a2e978e90a8894035af01905/ipython_sql-0.5.0-py3-none-any.whl.metadata
  Downloading ipython_sql-0.5.0-py3-none-any.whl.metadata (17 kB)
Collecting prettytable (from ipython-sql)
  Obtaining dependency information for prettytable from https://files.pythonhosted.org/packages/3d/c4/a32f4bf44faf95accbbd5d7864ddef9e289749a8efbc3adaad4a4671779a/prettytable-3.10.0-py3-none-any.whl.metadata
  Downloading prettytable-3.10.0-py3-none-any.whl.metadata (30 kB)
Requirement already satisfied: ipython in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython-sql) (8.26.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Obtaining dependency information for sqlalchemy>=2.0 from https://files.pythonhosted.org/packages/9b/29/2f57381879747658f0b2cff55eb3964296580a178690e3f672cfee45bc4c/SQLAlchemy-2.0.31-cp311-cp311-macosx_11_0_arm64.whl.metadata
  Downloading SQLAlchemy-2.0.31-cp311-cp311-macosx_11_0_arm64.whl.metadata (9.6 kB)
Collecting sqlparse (from ipython-sql)
  Obtaining dependency information for sqlparse from https://files.pythonhosted.org/packages/43/5d/a0fdd88fd486b39ae1fd1a75ff75b4e29a0df96c0304d462fd407b82efe0/sqlparse-0.5.0-py3-none-any.whl.metadata
  Downloading sqlparse-0.5.0-py3-none-any.whl.metadata (3.9 kB)
Requirement already satisfied: six in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython-sql) (1.16.0)
Collecting ipython-genutils (from ipython-sql)
  Obtaining dependency information for ipython-genutils from https://files.pythonhosted.org/packages/fa/bc/9bd3b5c2b4774d5f33b2d544f1460be9df7df2fe42f352135381c347c69a/ipython_genutils-0.2.0-py2.py3-none-any.whl.metadata
  Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl.metadata (755 bytes)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: decorator in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments>=2.4.0 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: pexpect>4.3 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in /Users/suvakantasamantray/.pyenv/versions/3.11.7/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Downloading SQLAlchemy-2.0.31-cp311-cp311-macosx_11_0_arm64.whl (2.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.1/2.1 MB 22.0 MB/s eta 0:00:00a 0:00:01
Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Downloading prettytable-3.10.0-py3-none-any.whl (28 kB)
Downloading sqlparse-0.5.0-py3-none-any.whl (43 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.0/44.0 kB 4.0 MB/s eta 0:00:00
Installing collected packages: ipython-genutils, sqlparse, sqlalchemy, prettytable, ipython-sql
Successfully installed ipython-genutils-0.2.0 ipython-sql-0.5.0 prettytable-3.10.0 sqlalchemy-2.0.31 sqlparse-0.5.0

[notice] A new release of pip is available: 23.2.1 -> 24.1.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
# Enabling our extension
%load_ext sql

In [3]:
# Creating the database
%sql sqlite:///sql-methods.db

In [8]:

%%sql
-- CREATING THE TABLE
CREATE 
TABLE IF NOT EXISTS employees(
    employee_id INTEGER PRIMARY KEY AUTOINCREMENT,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10,2) NOT NULL
);

 * sqlite:///sql-methods.db
Done.

[]

In [14]:
%sql PRAGMA table_info('employees')

 * sqlite:///sql-methods.db
Done.

[(0, 'employee_id', 'INTEGER', 0, None, 1),
 (1, 'first_name', 'VARCHAR(50)', 1, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 1, None, 0),
 (3, 'department', 'VARCHAR(50)', 0, None, 0),
 (4, 'salary', 'DECIMAL(10,2)', 1, None, 0),
 (5, 'hire_date', 'DATE', 0, None, 0),
 (6, 'performance_rating', 'INTEGER', 0, None, 0)]

In [15]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///sql-methods.db
Done.

[('employees',), ('sqlite_sequence',)]

In [11]:
%%sql
ALTER TABLE employees
ADD hire_date DATE;

ALTER TABLE employees
ADD performance_rating INTEGER;

 * sqlite:///sql-methods.db
Done.
Done.

[]

In [13]:
%%sql
--Insert data in our employees table
INSERT INTO employees(first_name,last_name, department,salary,hire_date, performance_rating)
VALUES ('John','Doe','Sales',50000.00,'2024-04-23',5);

INSERT INTO employees(first_name,last_name, department,salary,hire_date, performance_rating)
VALUES ('Subham','Samantray','Marketing',30000.00,'2024-04-21',4);

INSERT INTO employees(first_name,last_name, department,salary,hire_date, performance_rating)
VALUES ('Aishwarya','Roy','Engineering',70000.00,'2022-01-11',3);

INSERT INTO employees(first_name,last_name, department,salary,hire_date, performance_rating)
VALUES ('Martin','Crowe','Operations',40000.00,'2021-02-18',1);

INSERT INTO employees(first_name,last_name, department,salary,hire_date, performance_rating)
VALUES ('Xaviers','Mark','Operations',60000.00,'2021-12-20',2);

 * sqlite:///sql-methods.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## DISTINCT

The **DISTINCT** keyword is used to return only distinct (unique) values in the result set of a query. It ensures that duplicate rows are removed from the output.

In [21]:
%%sql
-- retrieve unique department
SELECT DISTINCT department
FROM employees;

 * sqlite:///sql-methods.db
Done.

[('Sales',),
 ('Marketing',),
 ('Engineering',),
 ('Operations',),
 ('Purchase',),
 ('Examinations',)]

In [20]:
%%sql
--Insert data in our employees table
INSERT INTO employees(first_name,last_name, department,salary,hire_date, performance_rating)
VALUES ('John','Doe','Purchase',55000.00,'2024-04-21',5);

INSERT INTO employees(first_name,last_name, department,salary,hire_date, performance_rating)
VALUES ('Subham','Samantray','Examinations',35000.00,'2024-03-20',5);

 * sqlite:///sql-methods.db
1 rows affected.
1 rows affected.

[]

In [22]:
%sql SELECT * FROM employees

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [23]:
%%sql
-- retrieve unique combinations of first name and last name

SELECT DISTINCT first_name, last_name
FROM employees;

 * sqlite:///sql-methods.db
Done.

[('John', 'Doe'),
 ('Subham', 'Samantray'),
 ('Aishwarya', 'Roy'),
 ('Martin', 'Crowe'),
 ('Xaviers', 'Mark')]

## LIMIT

The **LIMIT** clause specifies the maximum number of rows to return in a query result.

It's commonly used for:

*   Pagination: Retrieving results in smaller chunks, often used in web applications to display data in pages.
*   Performance optimization: Limiting the number of rows processed, especially for large datasets, can improve query speed.

In [25]:
%%sql
-- retrieving the first n employees from employees table

SELECT * FROM employees
LIMIT 5;

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2)]

In [28]:
%%sql
-- LIMIT ( starting offset, how many rows to display)
SELECT * FROM employees 
LIMIT 3,5;

 * sqlite:///sql-methods.db
Done.

[(4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

## COUNT
The **COUNT** function is used to count the number of rows in a table or the number of rows matching a specific condition.

In [29]:
%%sql
SELECT COUNT (*) FROM employees;

 * sqlite:///sql-methods.db
Done.

[(7,)]

In [30]:
%%sql
SELECT COUNT(DISTINCT department) 
FROM employees;

 * sqlite:///sql-methods.db
Done.

[(6,)]

In [31]:
%%sql
SELECT COUNT(DISTINCT department), COUNT() FROM employees;

 * sqlite:///sql-methods.db
Done.

[(6, 7)]

In [33]:
%%sql
SELECT COUNT (first_name) FROM employees
WHERE first_name ='Subham';

 * sqlite:///sql-methods.db
Done.

[(2,)]

# WHERE
The **WHERE** clause is used to filter data retrieved from a database based on specific conditions.
It allows you to narrow down your results to only include rows that meet certain criteria.
> **Common Operators Used in WHERE Clause:**
```
Comparison Operators:
  =: Equal to
  !=: Not equal to
  <: Less than
  >: Greater than
  <=: Less than or equal to
  >=: Greater than or equal to
Logical Operators:
  AND: Used to combine multiple conditions where both must be true.
  OR: Used to combine multiple conditions where at least one must be true.
  NOT: Used to negate a condition.
  
Special Operators:
  BETWEEN: Checks if a value falls within a specified range.
  IN: Checks if a value belongs to a set of values.
  LIKE: Used for pattern matching with wildcards.
  ```

In [39]:
%%sql
SELECT * FROM employees
WHERE department ='Operations';

 * sqlite:///sql-methods.db
Done.
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [36]:
%%sql
SELECT * FROM employees
WHERE department !='Operations';

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [40]:
%%sql
-- Using the less than sign
SELECT * FROM employees
WHERE performance_rating < 3;

 * sqlite:///sql-methods.db
Done.

[(4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2)]

In [41]:
%%sql
-- Using the greater than sign
SELECT * FROM employees
WHERE performance_rating > 3;

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [42]:
%%sql
-- Using the less than equal to sign
SELECT * FROM employees
WHERE performance_rating <= 3;

 * sqlite:///sql-methods.db
Done.

[(3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2)]

In [43]:
%%sql
-- Using the greater than equal to sign
SELECT * FROM employees
WHERE performance_rating >= 3;

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [44]:
%%sql
--using the equal sign
SELECT * FROM employees
WHERE department = 'Sales';
--using the not equal sign
SELECT * FROM employees
WHERE department != 'Sales';
--using the less than sign
SELECT * FROM employees
WHERE performance_rating < 3;
--using the greater than sign
SELECT * FROM employees
WHERE performance_rating > 3;
--using the less than or equal to sign
SELECT * FROM employees
WHERE performance_rating <= 3;
--using the more than or equal to sign
SELECT * FROM employees
WHERE performance_rating >= 3;

 * sqlite:///sql-methods.db
Done.
Done.
Done.
Done.
Done.
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [45]:
%%sql
-- Logical AND
SELECT * FROM employees
WHERE department ='Sales' AND performance_rating>3;

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5)]

In [46]:
%%sql
-- Logical OR
SELECT * FROM employees
WHERE department ='Operations' OR department ='Marketing';

 * sqlite:///sql-methods.db
Done.

[(2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2)]

In [47]:
%%sql
-- Logical NOT
SELECT * FROM employees
WHERE NOT department ='Marketing';

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [48]:
%%sql
-- Logical AND
SELECT * FROM employees
WHERE department = 'Sales' AND performance_rating >= 3;
-- Logical OR
SELECT * FROM employees
WHERE department = 'Operations' OR department = 'Marketing';
-- Logical NOT
SELECT * FROM employees
WHERE NOT department = 'Marketing';

 * sqlite:///sql-methods.db
Done.
Done.
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [49]:
%%sql
-- BETWEEN
SELECT * FROM employees
WHERE salary BETWEEN 50000 AND 60000;

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5)]

In [51]:
%%sql
--IN is similar to = but it will allow you to select multiple values
SELECT * FROM employees
WHERE first_name IN ('John', 'Martin');

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5)]

In [56]:
%%sql
--LIKE (useful for data navigation)
-- ending substring
SELECT * FROM employees
WHERE last_name LIKE '%Doe';

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5)]

In [58]:
%%sql
--LIKE (useful for data navigation)
-- starting substring
SELECT * FROM employees
WHERE first_name LIKE 'J%';

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5)]

In [59]:
%%sql
--LIKE (useful for data navigation)
-- containing
SELECT * FROM employees
WHERE first_name LIKE '%war%';

 * sqlite:///sql-methods.db
Done.

[(3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3)]

In [60]:
%%sql
--BETWEEN
SELECT * FROM employees
WHERE salary BETWEEN 50000 AND 60000;
--IN (similar to = but it will allow you to select multiple values)
SELECT * FROM employees
WHERE first_name IN ('John', 'Martin');
--LIKE (useful for data navigation)
--ending substring
SELECT * FROM employees
WHERE last_name LIKE '%Doe';
--starting substring
SELECT * FROM employees
WHERE first_name LIKE 'j%';
--containing
SELECT * FROM employees
WHERE first_name LIKE '%war%';

 * sqlite:///sql-methods.db
Done.
Done.
Done.
Done.
Done.

[(3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3)]

In [61]:
%%sql
--BETWEEN
SELECT * FROM employees
WHERE salary BETWEEN 50000 AND 60000;
--IN (similar to = but it will allow you to select multiple values)
SELECT * FROM employees
WHERE first_name IN ('John', 'Daniel');
--LIKE (useful for data navigation) 
-- '%son' - ending substring
SELECT * FROM employees
WHERE last_name LIKE '%son';
--'j%' - starting substring
SELECT * FROM employees
WHERE first_name LIKE 'j%';
--'%war%' - containing
SELECT * FROM employees
WHERE first_name LIKE '%war%';

 * sqlite:///sql-methods.db
Done.
Done.
Done.
Done.
Done.

[(3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3)]

## ORDER BY
The **ORDER BY** clause allows you to sort the results of your SELECT queries in either ascending or descending order. It lets you sort the retrieved data based on one or more columns, making it easier to analyze and interpret.
  * **ASC:** Ascending order (lowest to highest).
  * **DESC:** Descending order (highest to lowest).

In [62]:
%%sql
-- sorting by a single column
SELECT * FROM employees
ORDER BY last_name ASC;

 * sqlite:///sql-methods.db
Done.

[(4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [63]:
%%sql
-- sorting by a single column
SELECT * FROM employees
ORDER BY last_name DESC;

 * sqlite:///sql-methods.db
Done.

[(2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1)]

In [64]:
%%sql
-- sorting multiple columns
SELECT * FROM employees
ORDER BY department ASC, salary DESC;

 * sqlite:///sql-methods.db
Done.

[(3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5)]

In [65]:
%%sql
-- sorting multiple columns
SELECT * FROM employees
ORDER BY department ASC, salary ASC;

 * sqlite:///sql-methods.db
Done.

[(3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5)]

In [66]:
%%sql
-- sorting by expression
SELECT * FROM employees
ORDER BY performance_rating >3 ASC, salary DESC;

 * sqlite:///sql-methods.db
Done.

[(3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4)]

# GROUP BY
The **GROUP BY** clause is used to organize and summarize data by grouping rows with the same values in one or more columns. This helps you analyze trends, patterns, and aggregate statistics within your data.
> **Common Aggregate Functions Used with GROUP BY:**
```
  COUNT(): Counts the number of rows in each group.
  SUM(): Calculates the sum of a numeric column for each group.
  AVG(): Calculates the average of a numeric column for each group.
  MAX(): Returns the maximum value of a column for each group.
  MIN(): Returns the minimum value of a column for each group.
```

In [69]:
%sql SELECT * FROM employees;

 * sqlite:///sql-methods.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 5),
 (2, 'Subham', 'Samantray', 'Marketing', 30000, '2024-04-21', 4),
 (3, 'Aishwarya', 'Roy', 'Engineering', 70000, '2022-01-11', 3),
 (4, 'Martin', 'Crowe', 'Operations', 40000, '2021-02-18', 1),
 (5, 'Xaviers', 'Mark', 'Operations', 60000, '2021-12-20', 2),
 (6, 'John', 'Doe', 'Purchase', 55000, '2024-04-21', 5),
 (7, 'Subham', 'Samantray', 'Examinations', 35000, '2024-03-20', 5)]

In [71]:
%%sql
--Grouping with COUNT()
SELECT department, COUNT(*) AS employee_count
FROM employees
GROUP BY department;

 * sqlite:///sql-methods.db
Done.

[('Engineering', 1),
 ('Examinations', 1),
 ('Marketing', 1),
 ('Operations', 2),
 ('Purchase', 1),
 ('Sales', 1)]

In [72]:
%%sql
--Grouping with SUM()
SELECT department, SUM(salary) AS total_salary
FROM employees
GROUP BY department;

 * sqlite:///sql-methods.db
Done.

[('Engineering', 70000),
 ('Examinations', 35000),
 ('Marketing', 30000),
 ('Operations', 100000),
 ('Purchase', 55000),
 ('Sales', 50000)]

In [73]:
%%sql
--Grouping with AVG()
SELECT department, AVG(salary) AS average_salary
FROM employees
GROUP BY department;

 * sqlite:///sql-methods.db
Done.

[('Engineering', 70000.0),
 ('Examinations', 35000.0),
 ('Marketing', 30000.0),
 ('Operations', 50000.0),
 ('Purchase', 55000.0),
 ('Sales', 50000.0)]

In [74]:
%%sql
--Grouping with MAX() and MIN()
SELECT department, MAX(salary) AS maximum_salary
FROM employees
GROUP BY department;

 * sqlite:///sql-methods.db
Done.

[('Engineering', 70000),
 ('Examinations', 35000),
 ('Marketing', 30000),
 ('Operations', 60000),
 ('Purchase', 55000),
 ('Sales', 50000)]

In [77]:
%%sql
--Grouping with MAX() and MIN()
SELECT department, MIn(salary) AS minimum_salary
FROM employees
GROUP BY department;

 * sqlite:///sql-methods.db
Done.

[('Engineering', 70000),
 ('Examinations', 35000),
 ('Marketing', 30000),
 ('Operations', 40000),
 ('Purchase', 55000),
 ('Sales', 50000)]